Revit 2027 API
AnalyticalElement.AnalyzeAs Property
 This represents the Analyze As parameter assigned to Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalyzeAs AnalyzeAs { get; set; }
Public Property AnalyzeAs As AnalyzeAs
	Get
	Set
public:
property AnalyzeAs AnalyzeAs {
	AnalyzeAs get ();
	void set (AnalyzeAs value);
}
member AnalyzeAs : AnalyzeAs with get, set
Property Value
AnalyzeAs
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The provided AnalyzeAs is not supported
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace